[{"tweet": "<MENTION> <MENTION> Another alternative is not to eat pork at all… ? Recommended by Lancet etc to reduce consumption of meat for human and planetary health.", "hit_id": "3S37Y8CWJJNKMJUEO2OPQGSRSARW4U", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> Vegan is not a diet... It's a lifestyle with compassion for animals. Plant-based diet is part of it...", "hit_id": "34HEO7RUHHHUGCT9Y9OAGK6AS58RAX", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> <MENTION> We really don't need fast food workers, in case you didn't realize, fellow Americans. We do however, need farm workers, food production workers, etc. Since so many (overweight) lazy bums won't do it. Taxes should be going to raising wages for said willing necessary workers, imo.", "hit_id": "3ZZAYRN1JHEWYV02CHYNHURX579TOB", "known_answer": NaN}, {"tweet": "<MENTION> Why are their fruits on a vegetable list", "hit_id": "3SR6AEG6XGGIN0D9IAQW52MB8NDYHH", "known_answer": "0"}, {"tweet": "<MENTION> My entire family is vegan, vegetarian or pescatarian. We’ve had them all. Beyond and impossible are good!  The impossible whopper is a good one to start with.", "hit_id": "3WRKFXQBPMUIJVOTOS8H5ENQ80SYIA", "known_answer": NaN}, {"tweet": "<MENTION> South Indian pure vegetarian thali.  HEAVEN!", "hit_id": "3HY86PZXQ959DKB4GKBH6CEO9MD1E7", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> He’s speaking on the environment not misleading people on the health of a diet. He’s not vegan or vegetarian and he owns the largest share of farmland, about 270,000 acres.", "hit_id": "34O39PNDLHVZZMY14NO6BVQGANTRBS", "known_answer": "lacks context"}, {"tweet": "<MENTION> Of course. Veganism opposes farm animal existence. You wouldn't call that love.", "hit_id": "3R5OYNIC3NWEJVC3RHB26UWNFC5TPS", "known_answer": NaN}, {"tweet": "<MENTION> I'm not vegan", "hit_id": "3AA88CN990Q9PQEHOVTTIU2304HYKL", "known_answer": NaN}, {"tweet": "Fruits or vegetables? And why", "hit_id": "30Y6N4AHZ0JSEJWLIJFC6LEGD85RDZ", "known_answer": "0"}, {"tweet": "<MENTION> Are you Vegan?", "hit_id": "3XJOUITW95EZJ7DIRUQR6ZMXK8RTQJ", "known_answer": NaN}, {"tweet": "A doctor told me yesterday that she is recommending that all her patients switch to a plant-based diet because it is healthier!!!  It isn't healthier. 🤦‍♂️", "hit_id": "3BFF0DJK98ZBWNSVJYFW1Z1Y2WCTS8", "known_answer": "1"}, {"tweet": "Ok Paula's \"recipe\" for cooking fried chicken may be \"questionable\", even unsanitary(she didn't rinse chicken in in cold water long enough or the right way!😝😷 But what's with all the biracial insults &amp; name calling people?? Good grief!😒", "hit_id": "3CESM1J3FTQY16YS7QH4NEC5O1XW6F", "known_answer": "1"}, {"tweet": "<MENTION> <MENTION> Meat production, so, non stun killing, knifed to the throat, that OK?  Or should that be banned.", "hit_id": "3LG268AV4JTX6PALEEQWC3W1DK6RES", "known_answer": NaN}, {"tweet": "Is there a recipe in which ground beef, cheddar, and potatoes are the primary ingredients, which does not make a tasty dish? \n\nProbably, actually, but I just had an unexpectedly good one for dinner, so leave me alone about it.", "hit_id": "37AQKJ12U8BCBN5A8YKMB4XK4FQTTX", "known_answer": NaN}, {"tweet": "<MENTION> It’s pretty good, although the recipe called for fire roasting a poblano on a gas stove, but the closest I could get was my broiler. Next time I’d use more poblano, and maybe also throw some other peppers in there for some more spice.", "hit_id": "3VDVA3ILJO27XY7VMF156FZ0M2S1GO", "known_answer": NaN}, {"tweet": "<MENTION> Do you understand how our fruits and vegetables get to stores?", "hit_id": "33CLA8O0NTYPC3AH9PA2ULH1PLLRFA", "known_answer": "0"}, {"tweet": "The only difference between \"personality flaws\" and idiosyncrasies is the degree of your success.\nSteve Jobs without his success would just be vegan nutjob that neglected his family and mentally abused his employees.", "hit_id": "3ZVPAMTJXYQVQ36CK9GKC6HDQ0LRG9", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> <MENTION> <MENTION> Yes and “some people prefer to avoid them” references vegans who don’t eat meat alternatives, because it’s unnecessary. Those vegans are the healthier ones if anything. Fake meat doesn’t cause heart disease, but junk food vegans are a thing.", "hit_id": "32LAQ1JNUKCRB0KZ83AWG0JMNTXTUO", "known_answer": NaN}, {"tweet": "<MENTION> We are on the green bean diet here, too!  I love them.  Mom hasn't tried broccoli😱", "hit_id": "3EHVO81VOG8LXU266LJNRFB11251HN", "known_answer": "1"}, {"tweet": "<MENTION> <MENTION> <MENTION> <MENTION> Today is the 41st day of the war in Ukraine and US Energy Secretary Jennifer Granholm has still not met  with US oil and gas producers to see if there are ways the government and producers can work together to increase production.", "hit_id": "3J94SKDELTC39WYNLC293K9KLQH5D0", "known_answer": NaN}, {"tweet": "<MENTION> Oh?! Hmmm. Well, then you must eat lots of plants! 😬 Netflix has amazing plant based docs.", "hit_id": "3JMNNNO3CCRAJ5FRKO51X1VT8WW2W5", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> More people employed in plant based food production.", "hit_id": "3Y3N5A7N5RW4FEEK9769X7U7P9CYMQ", "known_answer": "lacks context"}, {"tweet": "What’d this plant do to be so based?", "hit_id": "3VGET1QS0BMH56CXQ0MWTSC1JCHW7E", "known_answer": "0"}, {"tweet": "<MENTION> <MENTION> <MENTION> If you have done research and came to the conclusion that veganism is a healthful way of eating, you have unfortunately fallen victim to vegan propaganda.", "hit_id": "3D5G8J4N6LRROF9ZDTK1CML5106TVD", "known_answer": NaN}, {"tweet": "<MENTION> Insane airdrop from IF <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION>", "hit_id": "3IVEC1GSM0MHO0XWULM83SRGEU91JS", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> If there is zero Carbon, it is not just meat that we won’t be eating.", "hit_id": "34R0BODSQCM812CNH7DT92R5L2I5ET", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> <MENTION> <MENTION> Ok, so sticking with your completely wrong Poore &amp; Nemecek data, how do beans come out?", "hit_id": "3P458N04RC4P85KHUT1NZK90HY22XY", "known_answer": NaN}, {"tweet": "<MENTION> I became vegetarian 2 years ago but I would not advice every meat-eating Hindu to become V'tarian. However, meat eating Brahmins should stop consuming meat.\n\nWe should not shy away from confrontation. Halal needs to be countered through 'non-halal' not vegetarianism.", "hit_id": "388FBO7J02GAXWZKL8L9AMJ7UZMYNQ", "known_answer": NaN}, {"tweet": "<MENTION> she was so skinny during that vegan diet", "hit_id": "3X2LT8FDI75L5KHG05E27S8WUWNW81", "known_answer": NaN}, {"tweet": "<MENTION>  IF the chancellor’s wife DID pay her tax, given that she is more wealthy than the Queen, how might this affect the social and care system and food banks? Even perhaps being able to continue free parking for NGS staff. #RishiSunak", "hit_id": "3XBYQ44Z70R4349433PXYO4J898TWN", "known_answer": NaN}, {"tweet": "The snowflakes have cancelled April Fools Day, instead carbon taxes and electric vehicles charged with electricity generated by burning coal makes fools of us everyday…", "hit_id": "37MQ8Z1JRPJE8AARZPNPIYG9J4W2Y4", "known_answer": "1"}, {"tweet": "<MENTION> CAN WE GET RID OF THE STUPID CARBON TAX", "hit_id": "3W0XM68Y00ICZK3EC6MK47RTTJ91KR", "known_answer": "1"}, {"tweet": "ate organic grocyer store sushi and yerb today feel like superman souljaa boy", "hit_id": "33TGB4G0M04JS4EUD8LJ07IQHBETXG", "known_answer": NaN}, {"tweet": "<MENTION> Mal:*sigh*\n\nMal: *rub his stomach* you hungry baby? What do you want mama to eat?\n\nIndo: A mother should eat healthy food you know. *Pat Mal* I will go grab some vegetables and fruits.\n\nPili: they seem pretty close these days. I wonder why?? I should check !", "hit_id": "3MNJFORX9MR07GCJCIXZRKC5X3X5FB", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> <MENTION> <MENTION> Why would oil companies increase production when there trying to destroy the oil industry. I sware liberals have no logic", "hit_id": "3D0LPO3EBMMSFHZWMNLMPBJCK9RYO5", "known_answer": NaN}, {"tweet": "<MENTION> I see! That’s good for your health too😆\nIf I could I’d be plant-based but I’m a fox… sadge", "hit_id": "3P7QK0GJ448ED0KWVBP8W5PBPY02ZV", "known_answer": NaN}, {"tweet": "<MENTION> Not in the long term we won't. Climate change affects the entire world through food production alone. It will only keep getting worse.", "hit_id": "31J7RYEC0WDNJQLWX6YLJ748IJE1LU", "known_answer": NaN}, {"tweet": "<MENTION> What are you, legumes 😺", "hit_id": "3J9L0X0VEQ9LJP0Q5XKG7O37E25W9Q", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> <MENTION> Start with the \"nimby\" TAX EXEMPT green-climate nonprofits that have those new, shiny buildings and open parking lots. Time for these tax exempt nonprofits who don't pay a dime in taxes to pony up and pay their fairshare.", "hit_id": "3EFNPKWBN3B6WXAPVHQL9GRHD5H30F", "known_answer": "1"}, {"tweet": "requirement against them.\n\nExtending the decision to exempt flour from all taxes and customs duties, until the end of the current month of April.\n\nGovernment Media Office\nApril 4, 2022 AD \nend/", "hit_id": "3KTCJ4SCWRO7P83HXIZ0JKJXIO41MW", "known_answer": NaN}, {"tweet": "<MENTION> Is there a vegetarian option??", "hit_id": "3LB1BGHFMDJ8S944I47LJLPZJH8TYM", "known_answer": NaN}, {"tweet": "<MENTION> If we cut out red meat, can we get a bigger rebate on our Carbon Tax in response to our contribution to the Cause? 😉", "hit_id": "3Q9SPIIRXU9ZO8AVX3YG3JERKKNWA5", "known_answer": "1"}, {"tweet": "<MENTION> <MENTION> But the carbon tax is killing the economy? It's just a few cents too .", "hit_id": "3I6NF2WGJRJ6LG8EN23H95CHYIX5GA", "known_answer": "lacks context"}, {"tweet": "Vegetarian maybe but not vegan", "hit_id": "356ZPKYPVS4A0HBX1NY1EBO2UENYPM", "known_answer": NaN}, {"tweet": "<MENTION> The lengths people will go to to avoid eating a plant-based diet.", "hit_id": "3D17ECOUPPI63MV7R0ULNLARIXN31I", "known_answer": NaN}, {"tweet": "<MENTION> We must stop subsidizing, exempting, and protecting big oil and plastic.", "hit_id": "33W1NHWFZS88XZE9EQ94XSY1PBCTZD", "known_answer": NaN}, {"tweet": "<MENTION> GO PLANT BASED DIET…..HEALTHIER", "hit_id": "31ANT7FQOJPKLC3P78LZU5OIDIA5H9", "known_answer": NaN}, {"tweet": "<MENTION> Big advocate of legumes &amp; beans. Many recipes available from which home cooks can use them to produce very tasty &amp; satisfying meals. Got out of the habit of eating right in college &amp; have paid the price. Now seeing great health changes from their addition to my weekly meal plans.", "hit_id": "33QQ60S6B35QVRN8A1MMWPHHQI0U0D", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> Wht If all veg peoples just stop breathing the air all animals breathing out too.\n\nWell... all meat shops should b inside, I agree! Not in open.\nFor this u can raise! Nt for shift all shop or temp. Ban etc.\nI need meat on daily basis, same way u need veg, wht to do?", "hit_id": "3ZLW647WBWIDS7D3A4UZS4KWA3132Z", "known_answer": NaN}]