[{"tweet": "Building and maintaining fruit and vegetable gardens provide a myriad of opportunities for students to apply critical and creative thinking skills. A school garden will be a main focus in my #educ4750 unit of work! #SDG2 #UoNTeach", "hit_id": "3JVP4ZJHE0FLM0S8GKX8DMT6WLU0IO", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> We are the biggest exporter and the most important exporter of halal meat to the world. If there is no exports where will you shove the halal issues? Stop exports to Halal nations.", "hit_id": "382GHPVPI3ENVLSQEIDNLJHUUFD347", "known_answer": NaN}, {"tweet": "<MENTION> I know people who are plant based but wear leather and use cosmetics that are tested on animals and feed their pets meat products. They're not vegan, even though they claim to be. They just eat a plant based diet for their own health.", "hit_id": "3XBXDSS89J6V9R6P4ZJSEG89NW8XLT", "known_answer": NaN}, {"tweet": "<MENTION> I'm sure you and the mini hoo would have coped admirably without mum - until the food ran out. If hoomum didn't come home we'd only notice her absence when we were hungry. 😁", "hit_id": "3J5XXLQDIXYMPYB5YEEAU9H77Z9V3A", "known_answer": "0"}, {"tweet": "Idk what high school student needs to hear this but no, your body does not need to do a “cleanse” and yes, your body does need food to survive so just because you *can* survive on water only doesn’t mean you *should*  #ThankMeLater", "hit_id": "3GL25Y685EHFF9OA4BK7ETNYN1YXMV", "known_answer": NaN}, {"tweet": "<MENTION> Thank you! I just purchased a small house with a big yard baded on your videos and writings about prepping and food shortage. I intend to put in a vegetable and possibly fruit garden.", "hit_id": "3YZ7A3YHSGG9BLH5I2XYYJVKMR6S5S", "known_answer": NaN}, {"tweet": "Stuck for a dinner idea? Try this! Start with some Israeli cous cous, and some arugula.  Add in some taco meat or if you're vegetarian, your choice of meat alternative.   Toss in some fresh mozzerella, sliced sundried tomatoes, and finally almonds.", "hit_id": "3UOMW19E7OTT44S9LG7YJER20OL5CC", "known_answer": NaN}, {"tweet": "<MENTION> Ya it’s true! And I mostly eat the veggies and whole grains, nuts, etc., not much ‘made for #vegans’ foods. I did eat meat for 25 years tho and loved bacon. We do it because we want reduce animal suffering. That’s the entire drive. Fake bacon exists to replace real pigs", "hit_id": "30UZJB2PPSZ5R4WQSNWXQBN8UB835C", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> <MENTION> <MENTION> I got no problem with vegans btw, or vegan people who turn their pets into vegans. I don't like adults raising their children to be degenerates", "hit_id": "3SD15I2WEDH1A8W4X662IH18Q6J36S", "known_answer": NaN}, {"tweet": "Is there a recipe in which ground beef, cheddar, and potatoes are the primary ingredients, which does not make a tasty dish? \n\nProbably, actually, but I just had an unexpectedly good one for dinner, so leave me alone about it.", "hit_id": "38XPGNCKI4N77UU9YSJT4E9DLZ5V4V", "known_answer": NaN}, {"tweet": "requirement against them.\n\nExtending the decision to exempt flour from all taxes and customs duties, until the end of the current month of April.\n\nGovernment Media Office\nApril 4, 2022 AD \nend/", "hit_id": "3J9UN9O9KEFHHBCEY2I8PN8690J0J0", "known_answer": NaN}, {"tweet": "<MENTION> I don't have a problem with vegans or veganism. What I do have a problem with are the judgemental and way too often racist vegans that use it to act superior to others.", "hit_id": "38B7Q9C29RSNPALKEF7C9U4UQYT69C", "known_answer": NaN}, {"tweet": "<MENTION> Don't panic its not organic haha", "hit_id": "3FBEFUUYSVS1UTVP6LLC5PFEWGB6AR", "known_answer": NaN}, {"tweet": "<MENTION> “Huh. Maybe you’re not the kind to do that. Well, back to your idea hatchin’ then.” \n\nHe leaned up from his hammock, taking the massive bowl of soup his lackeys made for him. Good thing they got the recipe from Leo’s mate.", "hit_id": "3XEDXEGFYEBCSVIWGNIKQ28JOPJ0KZ", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> <MENTION> I think bug consumption is an ethical and sustainable  replacement for meat tbh! Seems pretty cool to me!", "hit_id": "3QI9WAYOH1Y5UPHJNL73QP9KIMHS68", "known_answer": NaN}, {"tweet": "<MENTION> It's up to 'we the people' to come together and demand changes/implemented these changes ourselves because our government has failed us. Transition to a plant based diet. If you can, grow your own food and save water. Work within your community to implement these changes.", "hit_id": "3FI30CQHWV66D30HCZL800ZKEYW6BM", "known_answer": NaN}, {"tweet": "<MENTION> I'm a vegetarian and I like plant based meat, but to each his own right?", "hit_id": "3VI0PC2ZB973FC9MHRZK6XC3I1DXOA", "known_answer": NaN}, {"tweet": "<MENTION> I work at the terrace and rumor has it if you come for food after your round tomorrow then your guaranteed to be getting that green jacket on Sunday.", "hit_id": "32XN26MTYA6NC10E1NUL52LYDPO0L2", "known_answer": "0"}, {"tweet": "<MENTION> <MENTION> Ro! Are you going to stand behind YOUR comments from October 28 hearing with oil executives from top US oil firms that they continue to REDUCE their energy production? You and you party want less production thus we have higher prices which is a big fat tax on the middle class!", "hit_id": "3D1UCPY6HRWOEMFSQL302VXZW1938E", "known_answer": NaN}, {"tweet": "It ain't even about JUST food, there are several ways this can be done!\n\nAnd The IPCC and every reputable nonbiased Study say plant-based diets are the least harmful of western diets, that includes Meat, since its everything \"wrong\" with Vegan diets x10. This is easily citable.", "hit_id": "3NOEP8XAVFPL0CLNWRCZVXHTS69XPR", "known_answer": "1"}, {"tweet": "<MENTION> <MENTION> <MENTION> Switch to plant based diets to reduce food costs and benefit climate", "hit_id": "3BS6ERDLAEUZS0Y1QVCEVQNKHJ86DT", "known_answer": "1"}, {"tweet": "<MENTION> 'decolonising vegan diets' is such a nonsensical concept wtf", "hit_id": "36818Z1KWE02XA87NJNEYM3UMP93AI", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> <MENTION> Switch to plant based diets to reduce food costs and benefit climate", "hit_id": "3B623HUYKFDSY307G041A35BOH7S8U", "known_answer": "1"}, {"tweet": "okay um at this point seoul has better meat alternative options than where I am living in Canada what the fuck there are PAGES of it", "hit_id": "372AGES0JFS6CP129JGO0SH8TOXXRJ", "known_answer": NaN}, {"tweet": "<MENTION> I was a vegetarian in my late teens/early 20s; I'd generally rely on meat substitutes such as tofu and seitan. Hard to hit high protein for the day without them as a vegetarian", "hit_id": "3VCK0Q0PPG1D013ZD0A0IUPNIKO0N4", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> In theory someone doesn't need to eat plant-based diet to be vegan, if that isn't possible for you because of a disability or illness or lack of access. All you need to do is avoiding to contribute to harming animals in ways that are practically possible for you. +", "hit_id": "3MNJFORX9MR07GCJCIXZRKC5X1D5FN", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> Fruit cake. My dad is pickled onions lol", "hit_id": "3XD2A6FGGYHSC8JHLSAFAZ0M8NPS9J", "known_answer": NaN}, {"tweet": "<MENTION> Or maybe preparing to negatively impact US food production during a future crisis?", "hit_id": "3WA2XVDZFX44K6C1MQNY1855HV96EM", "known_answer": NaN}, {"tweet": "<MENTION> India should ban meat eating it is highly immoral plus ecologically unsustainable stop it", "hit_id": "37Y5RYYI10SID41FO8GTQ2M4FQGXS7", "known_answer": NaN}, {"tweet": "<MENTION> That’s great for vegetarian diets.", "hit_id": "36FQTHX30EE7GKDZTXNATXN047U3BD", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> No the carbon tax will pay for it and also change the climate and save the earth. My God people are so gullible.", "hit_id": "32PT7WK7EX20VHBJ7TEGONB07S63DK", "known_answer": "1"}, {"tweet": "<MENTION> <MENTION> Shail saab indian cars riders are not bothered about Rs 120 petrol rate. Those people who go by public transport ther are facing real problems with fuel price hike normal citizen paying more vegetables fruits cargo transports. RS 140 tak jayega is saal may. Abhi election nahi hai", "hit_id": "34KYK9TV32VB01YEJCOB15VCWNSSBT", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> Please vegan/vegetarian bukan vegetable 😭😭😭", "hit_id": "33TGB4G0M04JS4EUD8LJ07IQH9UXTW", "known_answer": NaN}, {"tweet": "<MENTION> Aldi and Costco have really great meatless alternatives!! I get “chicken” patties and veggie burgers and literally would not even realize they’re meat free if I hadn’t have bought them lol", "hit_id": "3N7PQ0KLJGC5NNPJ3OP0U5TL7473ED", "known_answer": "1"}, {"tweet": "<MENTION> Actually we don't care if it's halal or something. Why does that even matter if we eat meat? People need to stop involving politics in everything.", "hit_id": "3I6NF2WGJRJ6LG8EN23H95CHYGD5GM", "known_answer": "1"}, {"tweet": "<MENTION> <MENTION> She seem to be working 16hrs a day, 7days a week. What food does she eat?", "hit_id": "3B9J25CZ3G0UA6QKXCK6CP1UE8SSC0", "known_answer": NaN}, {"tweet": "<MENTION> We built an economy that rivaled the world. We invented plant-based fuel. We had a military force that brought the world in awe. This military consisted of blacks and whites... And this we did only for communists to destroy it within 20 years?", "hit_id": "31ANT7FQOJPKLC3P78LZU5OIDGQ5HL", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> <MENTION> My whole point was that she equated veganism to a cesspool blah blah blah.  Just a terrible random description to make her point.  Who really cares?  \n\nPeople just try so hard they sound silly is all I’m saying.", "hit_id": "3E6L1VR4Y79WQKCXH174JQQ5TWO6F4", "known_answer": NaN}, {"tweet": "Well <MENTION> <MENTION> <MENTION> <MENTION> I would have like to have reviewed <MENTION> plant-based katsu burger for you, but they elected to give me the meat one instead...", "hit_id": "3Y40HMYLMC5YSHTJDDBT534S0N1XUN", "known_answer": NaN}, {"tweet": "<MENTION> I won’t be able to afford it because of your carbon taxes !", "hit_id": "3TZDZ3Y0K3TSIOKN89VVEYDDIND91H", "known_answer": NaN}, {"tweet": "<MENTION> <MENTION> Haha they taste too good to leave, I promise! 😂 I’ve been perfecting the sugar cookie recipe so they’re soft and not too crunchy!", "hit_id": "30F94FBDO27CF1BT8CT1BARYY67BT2", "known_answer": NaN}, {"tweet": "years ago, id be glad to see so many alternative meat options. now, i’m HIGHLY skeptical of plant-based meat. have y’all even read the ingredients on em????", "hit_id": "3538U0YQ2QHXT1PFYZ96CNELJ5M3FV", "known_answer": NaN}, {"tweet": "<MENTION> Reduce meat and dairy, increase egg and legume consumption for protein. Also, lots of PB&amp;Js!", "hit_id": "35O6H0UNM33GCIYFV8OK6I4XQ8U5JQ", "known_answer": NaN}, {"tweet": "<MENTION> That carbon tax is sure helping", "hit_id": "39O6Z4JLYDKY5WIJI3LY1P6BEUAXVC", "known_answer": "lacks context"}, {"tweet": "Good morning Friends\n\ni decided to start organic kitchen next month.\n\nGuide me about the good, tastly &amp; healthy foods you ever had.\n\nThanks.", "hit_id": "3FJ2RVH26ATZ792JRDV9JHNIATR92Y", "known_answer": NaN}, {"tweet": "The foundation of my diet is plant-rich, not plant-based. \n\nPlant-rich diets contain whole foods such as vegetables, fruit, legumes, nuts, seeds, and high-quality meat.", "hit_id": "3Z8UJEJODA0OSRY2VD9E2RSAG7R939", "known_answer": NaN}, {"tweet": "in a few hours the FY in #India is coming to the end and the last Quarter of #Nashik production is the 1st Quarter in #Bosnia, #Peru and #Germany. This month we have been able to add weekly 1 German speaking colleague. Next Quarter target is 2 new colleagues a week.", "hit_id": "3JTPR5MT03ZBN24XDTOW7X4A5XU5KP", "known_answer": NaN}, {"tweet": "<MENTION> Do you know about Balance of Nature?  It's a high powered fruit and vegetable pills.  Fruits and veggies have 2 different pills.  I have it listed on my other profile <MENTION> If interested.  May help the pain.", "hit_id": "3APP19WN8C124K8SSLDM1BQHUBO6G3", "known_answer": "1"}, {"tweet": "<MENTION> <MENTION> So people who promote vegan or carnivore and have a diet plan to sell?", "hit_id": "31MCUE39CV9371LA9JFOU8EXKKM3GU", "known_answer": "0"}, {"tweet": "<MENTION> I don't think anyone restricts their diet soley to chick peas. Vegan diet combinations can provide all essential amino acids.", "hit_id": "3VQTAXTYOE8RFEQI8HJBG6D0HKEBUT", "known_answer": NaN}]