[{"tweet": "Hindus must do one thing,just stop eating halal meat 90percent of meat shops will be automatically close.   #meatban", "claim": "We should reduce the consumption of meat"}, {"tweet": "<MENTION> You can put full stop for eating meat. Good for health", "claim": "We should reduce the consumption of meat"}, {"tweet": "Dear <MENTION> we are getting 2 tax invoices from <MENTION> with mentioning your GST no. And they are denying to add my GST in that same invoice. Request your kind attention please invoice no. 2100095200001809 n 2100095220000272 <MENTION>", "claim": "no claim"}, {"tweet": "I’m such a bad vegetarian all I do is want meat on JAH", "claim": "We should reduce the consumption of meat|Vegan and vegetarian diets should be encouraged"}, {"tweet": "<MENTION> <MENTION> <MENTION> <MENTION> You are right. There isn’t a huge decrease in demand for meat and dairy. However big changes are coming. Veganism has never been talked about as much as it has in the last couple years. The pandemic highlighted a lot of flaws in humanity and people had time to reflect and watch", "claim": "We should reduce the consumption of meat|Vegan and vegetarian diets should be encouraged"}, {"tweet": "<MENTION> <MENTION> <MENTION> <MENTION> 2. Much of the ⬆️ in production is driven by area expansion rather than productivity, which is not sustainable growth. On food sec. I think we need to look beyond maize and support other crops, livestock, poultry &amp; fisheries to diversify food production &amp; improve nutrition", "claim": "We should reduce the consumption of meat|Plant based food should be encouraged|We should pursue policies that promote sustainable foods"}, {"tweet": "<MENTION> <MENTION> <MENTION> <MENTION> <MENTION> You know there are Bible verses that support veganism, right? Or are we selective in the verses by which we live?", "claim": "Vegan and vegetarian diets should be encouraged"}, {"tweet": "<MENTION> <MENTION> <MENTION> <MENTION> The Halal boycott will have an impact on the sales of poor meat sellers we must increase our meat consumption and reduce vegetables and fruits ideally the carnivore diet is way better then a high carb one .", "claim": "We should reduce the consumption of meat|Plant based food should be encouraged|Vegan and vegetarian diets should be encouraged"}, {"tweet": "<MENTION> <MENTION> <MENTION> While I support meat eating, I also think, meat should not be primary food for human anymore as there are alternatives, easier to eat ( faster to eat and digest, saving time). Meat requires lot of time to cook than other alternatives. ( My one of the main reasons for meat ban)", "claim": "We should reduce the consumption of meat|Meat alternatives should be encouraged"}, {"tweet": "<MENTION> People have been eating meat and owning property since the stone age.  It’s sustainable.", "claim": "We should reduce the consumption of meat"}, {"tweet": "<MENTION> Unfortunately in too many cases, patients that want a plant based diet have significant health problems caused by that diet", "claim": "Plant based food should be encouraged|Vegan and vegetarian diets should be encouraged"}, {"tweet": "<MENTION> Yes stop eating meat during festive season. Full stop.", "claim": "We should reduce the consumption of meat"}, {"tweet": "My preference on airport expansion is a localist liberal one by the way. Allow all airport expansion supported by local democracy, stop regulating the price of landing slots (so Londoners pay the cost of Heathrow not expanding), and put a proper carbon tax on aviation fuel.", "claim": "no claim"}, {"tweet": "<MENTION> I think some food production practices may be harmful to the environment, for example increasing green house gas emissions associated with livestock. Importing and exporting food may also be damaging, increasing the global carbon front print. #NUTR0800522", "claim": "We should reduce the consumption of meat|We should pursue policies that promote sustainable foods"}, {"tweet": "Being a Non-vegetarian is a choice, a freedom which is granted to us by our constitution , why to stop any vendor to provide meat ??? Sheer nonsnese \n#meatban #southdelhi #MeatBanPolitics #meatshops #freedom #choice #", "claim": "We should reduce the consumption of meat|Vegan and vegetarian diets should be encouraged"}, {"tweet": "I hope till now railway high officially has taken some action on this poor quality food.....<MENTION> <MENTION> <MENTION> <MENTION> <MENTION>", "claim": "no claim"}, {"tweet": "hits used to be so organic oh my god…like no stans just loads of causal listeners enjoying the music", "claim": "no claim"}, {"tweet": "<MENTION> They eat prescription wet food mixed with a little prescription dry. But I have dehydrated bacon \"dust\" in the emergency supplies in the truck. If his appetite doesn't improve, well add some of that and see.  :)", "claim": "no claim"}, {"tweet": "<MENTION> <MENTION> <MENTION> People should be aware of how they are nourishing their bodies, I agree 100%. I'd love for there to be more good information about how to do veganism right as far as health is concerned. So I don't disagree in that regard.", "claim": "Vegan and vegetarian diets should be encouraged"}, {"tweet": "<MENTION> Isn’t that the same person who said putting carnivores on vegan diets is good?", "claim": "no claim"}]