[{"tweet": "<MENTION> Don't even try. Change to a healthier whole food plant based diet and your body adjusts in the time needed.", "topic": "Plant based food should be encouraged", "evidence": "normative"}, null, {"tweet": "Imagine being a horse girl. Like there are so many non-horse meat alternatives", "topic": "Meat alternatives should be encouraged", "evidence": "no evidence"}, {"tweet": "The report finds:\n\n1. Growing demand for meat will push production up by 14% by 2029. \n\n2. Hard-to-change behaviours like diets require a transition to more sustainable food sources. \n\n3. Sustainable proteins “promise substantial reductions in direct GHG emissions from food”.", "topic": "We should pursue policies that promote sustainable foods", "evidence": "study"}, {"tweet": "<MENTION> <MENTION> This sounds like wishful thinking. It would be so convenient if everyone's favourite food was the healthiest. Life is not so nice and brutal reality sets in. \n\nNo, you can't eat only meat and veggies and be healthy. And no, eating too much meat is not ethical. Sorry guys", "topic": "Vegan and vegetarian diets should be encouraged", "evidence": "normative"}, null, {"tweet": "It ain't even about JUST food, there are several ways this can be done!\n\nAnd The IPCC and every reputable nonbiased Study say plant-based diets are the least harmful of western diets, that includes Meat, since its everything \"wrong\" with Vegan diets x10. This is easily citable.", "topic": "Vegan and vegetarian diets should be encouraged", "evidence": "study"}, {"tweet": "<MENTION> It would also be nice if our government could begin subsidizing more sustainable options (like plant based meat) vs things like beef\n\nbut... i digress", "topic": "Vegan and vegetarian diets should be encouraged", "evidence": "no evidence"}, {"tweet": "<MENTION> <MENTION> Ahaha you can find just as much if not more in plant based diet 😄. Or if your taste buds really can't let the taste of meat go, you can always go for lab developed meat", "topic": "We should pursue policies that promote sustainable foods", "evidence": "no evidence"}, {"tweet": "<MENTION> Can india stop exporting meat, mutton for 9 days..it will boost sentiment of this 99%", "topic": "We should pursue policies that promote sustainable foods", "evidence": "no evidence"}, {"tweet": "<MENTION> I’d live on only fruits &amp; vegetables before I subsisted on any plant based meat product. TF is wrong with people. The rube goldberg of human diets.\n\nMoobs are not a good look there Bill.", "topic": "Meat alternatives should be encouraged", "evidence": "no evidence"}, {"tweet": "<MENTION> I think eating a plant based diet is fantastic, I also see merits to consuming bugs from a sustainability standpoint. I'm also all for banning eating mammals. But personally, I'm not a fan of tribalism - us vs them mentality. It's what lead to the greatest tragedies in history.", "topic": "Plant based food should be encouraged", "evidence": "anecdotal"}, {"tweet": "<MENTION> <MENTION> <MENTION> Actually it would, because meat cut straight from a carcass doesn't have all the additives that meat production factories use.", "topic": "We should reduce the consumption of meat", "evidence": "normative"}, {"tweet": "<MENTION> Stop packed food.\nCheck liver problems.\nEat salad and fruits, less of grains.\nStop meat, milk and egg.\nPatanjali Lipidom.\nAlways have disprin tab with you in case of any pain.\nIn case of pain 1 disprin 325 mg+ 40 mg rovustatin+ 150 mg clopidrogel as emergency  treatment.", "topic": "We should reduce the consumption of meat", "evidence": "no evidence"}, {"tweet": "When talking about plant-based meat alternatives I think there is a key issue to consider: processing. \n\nThese new foods are highly/ultra processed foods because they are designed to resemble their meat counterparts.\n\nBut are these foods unhealthy then? A 🧵", "topic": "Meat alternatives should be encouraged", "evidence": "fact"}, {"tweet": "<MENTION> Stop packed food.\nCheck liver problems.\nEat salad and fruits, less of grains.\nStop meat, milk and egg.\nPatanjali Lipidom.\nAlways have disprin tab with you in case of any pain.\nIn case of pain 1 disprin 325 mg+ 40 mg rovustatin+ 150 mg clopidrogel as emergency  treatment.", "topic": "We should reduce the consumption of meat", "evidence": "no evidence"}, {"tweet": "<MENTION> <MENTION> I eat meat all the time. I'm gonna vote for sustainable practices, but if corporations get to dump CO2 and pollutants in megatonne numbers every year, I'm gonna continue to buy ground beef from the store. Individual guilt around climate change only helps the real problem-makers.", "topic": "We should pursue policies that promote sustainable foods", "evidence": "fact"}, {"tweet": "<MENTION> Good point about the poor chickens 😭  that's why I support plant based diet 🌿", "topic": "Plant based food should be encouraged", "evidence": "anecdotal"}, {"tweet": "At some point it’s just healthier to have the actual non vegan foods than that lab made “plant based” bullshit that my stomach can’t digest lmao", "topic": "Plant based food should be encouraged", "evidence": "anecdotal"}, {"tweet": "There’s not enough adequate vegans on social media, who advocate for veganism without making people who eat meat feel bad.", "topic": "We should pursue policies that promote sustainable foods", "evidence": "no evidence"}, {"tweet": "I don’t like fruits and vegetables in general", "topic": "Plant based food should be encouraged", "evidence": "no evidence"}, {"tweet": "<MENTION> \"Plant-Based\" is an evolved term from the primitive \"vegan\" &amp; marketing creative \"Flexitarian\". \nIts basis is evolutionary mainstream science. A psuedo antithesis of traditional alternative theory such as flat earth, cultural diets)\nLiterally promoting Fat Earth &amp; Technocratism.", "topic": "Plant based food should be encouraged", "evidence": "normative"}, {"tweet": "<MENTION> Best and most inexpensive is a plant-based diet. Eliminate meat, dairy and eggs and your grocery bill will be reduced significantly.", "topic": "Plant based food should be encouraged", "evidence": "normative"}, {"tweet": "<MENTION> <MENTION> This is so disappointing from the EPA. How can the answer to deforestation, habitat and biodiversity loss, CO2 emissions and water consumption be 'eat a bit less meat'? #Veganism IS the answer and the EPA should be promoting a #plantbasedfoodsystem.", "topic": "Vegan and vegetarian diets should be encouraged", "evidence": "normative"}, null, {"tweet": "<MENTION>\nIf you want to discuss a plant based diet,why don't you discuss it with a plant based dietician.    W.H.O. has stated a plant based diet is suitable for all stages of human life.", "topic": "We should pursue policies that promote sustainable foods", "evidence": "expert"}, {"tweet": "<MENTION> <MENTION> Wrong, bitter Chad. I’m an advocate for a plant-based diet while never telling other people what they should or shouldn’t eat. Only what works for me. And McDonald’s also offers vegan alternatives, so take your jealous outrage and shove it up your ignorant ass. #fail", "topic": "Vegan and vegetarian diets should be encouraged", "evidence": "fact"}, {"tweet": "<MENTION> <MENTION> A modified Carnivore diet is what I’m currently on, meats, berries, fermented foods mostly. I’ve also tried a more plant based approach with kale shakes loaded with things like ginger, turmeric, and beet but it was eh. The less carb high protein and fat diets work best for me.", "topic": "We should reduce the consumption of meat", "evidence": "anecdotal"}, null, {"tweet": "<MENTION> Agree, but again this has nothing to do w/ veganism. If vegan diets fall short, the goal shouldn't be to dismiss them, but to find solutions, like cultured meat/dairy. And can still adopt other vegan practices like cruelty-free cosmetics, boycotting the circus, etc.", "topic": "We should reduce the consumption of meat", "evidence": "no evidence"}, {"tweet": "<MENTION> This generation you speak of will never exist. Meat alternatives are not sustainable. We’d also have to euthanize animals to get them back in a controlled population effectively killing more than the meat industry will. So 🤷‍♂️", "topic": "Meat alternatives should be encouraged", "evidence": "normative"}, {"tweet": "<MENTION> 9/And no...not interested in an argument. I'm interested in a discussion. I posted it before, but I think it's probably the best primer on how/why a low-fat plant-based diet can help turn people's health and lives around. It's written by an ex-vegan...", "topic": "Plant based food should be encouraged", "evidence": "no evidence"}, {"tweet": "<MENTION> Exactly this! The problem is Germany and Austria made themselves depended on Russia’s oil and gas over the last few years, so Putin has them as his puppets… they will not budge. Hungary is traitor for EU..sad. EU and US must find a way. US to increase its own production spply EU", "topic": "We should pursue policies that promote sustainable foods", "evidence": "no evidence"}, {"tweet": "If you can’t afford the high price of ethically raised/farmed free range or grass fed cheese/eggs/fish or meat then go vegetarian. The vegan obsession with making animal’s lives so much better than your own or other humans is misplaced, inhumane and ridiculous!", "topic": "Plant based food should be encouraged", "evidence": "normative"}, {"tweet": "Leave people and their food choices alone. Just because you don’t eat pork or red meat doesn’t mean the world has to stop eating it too. Love that for you but I will continue to enjoy my pork chops and ribeyes.", "topic": "We should pursue policies that promote sustainable foods", "evidence": "no evidence"}, {"tweet": "<MENTION> This generation you speak of will never exist. Meat alternatives are not sustainable. We’d also have to euthanize animals to get them back in a controlled population effectively killing more than the meat industry will. So 🤷‍♂️", "topic": "Meat alternatives should be encouraged", "evidence": "no evidence"}, {"tweet": "Eat fruits and vegetables #HealthandFitness", "topic": "We should reduce the consumption of meat", "evidence": "no evidence"}, {"tweet": "<MENTION> <MENTION> Doesn't matter, you can combine them with other different plant based food items in a balanced PB diet. \nLentils also provide all ESSENTIAL amino acids.\n\nProtein quality is a non issue on PB diets if a range of foods are combined, just like they should be.", "topic": "Plant based food should be encouraged", "evidence": "fact"}, {"tweet": "<MENTION> <MENTION> <MENTION> By their own admission energy companys are putting profits for shareholders over more production creating a false supply and demand problem. Just to add more to the $60 billion in their coffers now! You got a beef with the republicans helping these bastards not the POTUS.", "topic": "Meat alternatives should be encouraged", "evidence": "no evidence"}, {"tweet": "<MENTION> <MENTION> <MENTION> <MENTION> Then again all the other issues we have brought up with veganism that we have already explained many people would get sick or at least suffer of malnutrition if they tried veganism on their own as such it is morally acceptable for then ask people to buy and eat meat", "topic": "Meat alternatives should be encouraged", "evidence": "no evidence"}, {"tweet": "I think #vegetarians who live according to altruistic love and compassion are closer to heaven than those who are willing to kill animals. #Jesus says, \"The merciful people are blessed and receive mercy.\"\n#vegetarian \n#Holybible #GoVegan #Vegan #christ #AnimalRights #Veganism", "topic": "Vegan and vegetarian diets should be encouraged", "evidence": "normative"}, {"tweet": "<MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> <MENTION> The cynical reality is that a ban on coal from Russia is accompanied by an increase in demand for gas. We use gas to produce electricity as well. You can use coal or gas for the production of electric as an alternative to green energy sources. We don't have enough green energy.", "topic": "We should pursue policies that promote sustainable foods", "evidence": "no evidence"}, null, {"tweet": "<MENTION> are you even remotely aware how much carbon emissions meat diets are responsible for? Its stupid to be a non vegetarian", "topic": "Meat alternatives should be encouraged", "evidence": "normative"}, {"tweet": "<MENTION> <MENTION> the FLAVOR IS WHAT MATTERS. green is so much flavorful and brings out the best in food.", "topic": "Plant based food should be encouraged", "evidence": "no evidence"}, {"tweet": "<MENTION> My diet is primarily fresh vegetables and fruits. Every dish I make is 90% plant based. I still eat seafood, cheese and eggs. I rarely eat anything processed.", "topic": "Vegan and vegetarian diets should be encouraged", "evidence": "anecdotal"}, {"tweet": "<MENTION> Stop packed food.\nCheck liver problems.\nEat salad and fruits, less of grains.\nStop meat, milk and egg.\nPatanjali Lipidom.\nAlways have disprin tab with you in case of any pain.\nIn case of pain 1 disprin 325 mg+ 40 mg rovustatin+ 150 mg clopidrogel as emergency  treatment.", "topic": "We should reduce the consumption of meat", "evidence": "no evidence"}, {"tweet": "<MENTION> Good point about the poor chickens 😭  that's why I support plant based diet 🌿", "topic": "Plant based food should be encouraged", "evidence": "no evidence"}, {"tweet": "<MENTION> <MENTION> <MENTION> An ethical commitment to not kill and eat animals, or to avoid systems that do, is separate (in principle) from how vegan diets impact the biosphere. Non-consumption of flesh is a stand alone commitment. \n\nThat said, I agree that there are larger, more ecological issues at stake.", "topic": "Plant based food should be encouraged", "evidence": "fact"}, {"tweet": "<MENTION> <MENTION> <MENTION> <MENTION> plus a lot of people have health conditions that are much easier controlled with plant based diets! i personally have gi issues and a vegan date greatly improves my quality of life but i still like the taste of meat so i cook a lot of substitutes", "topic": "Meat alternatives should be encouraged", "evidence": "anecdotal"}]