{"It is said that during her penance to obtain Lord Shiva as husband, she spent 1000 years on the diet of flowers and fruits and another 100 years on the leafy vegetable diet while sleeping on the floor.\n\n5/n": ["no claim"], "Vegan and vegetarian food would benefit so much from just doing their own thing or at least not make recreating meat dishes their main priority. Some vegetarian dishes are so delicious because they’re not trying to compare and just are. Lo han cai? 🤤 ❤️ Tofu noodles? 🥴 ❤️": ["We should reduce the consumption of meat", "Meat alternatives should be encouraged", "Vegan and vegetarian diets should be encouraged"], "<MENTION> <MENTION> I have a grandson with Asperger’s &amp; fussy about food/eating. We place regular healthy snacks alongside him when he is playing or reading. Grate veggies in stews. Add cricket protein powder to soup &amp; smoothies as he doesn’t eat much meat. We try to be very blasé about it.": ["no claim"], "<MENTION> Do you know about Balance of Nature?  It's a high powered fruit and vegetable pills.  Fruits and veggies have 2 different pills.  I have it listed on my other profile <MENTION> If interested.  May help the pain.": ["no claim"], "maybe i’ll just be a vegan on weekdays. does that count": ["Vegan and vegetarian diets should be encouraged"], "<MENTION> <MENTION> I think I heard that somewhere too that eventually it will all be vegan, no more vegetarian.": ["no claim"], "<MENTION> <MENTION> I can agree with everything you just except said the meat thing...we should be doubling the pasture raised beef production.": ["We should reduce the consumption of meat", "We should pursue policies that promote sustainable foods"], "<MENTION> I'll go for a trifecta of examples that sometimes vegan meat alternatives taste better than the meat.\nCoconut bacon and tempeh bacon &gt; actual bacon\nSeitan cold cuts &gt; cold cuts\nHomemade veggie burgers &gt; burgers": ["We should reduce the consumption of meat", "Meat alternatives should be encouraged"], "just ate my body weight in food for imsak and i need to shit right now bc there absolutely no way i am going to school being this bloated": ["no claim"], "Imagine being a horse girl. Like there are so many non-horse meat alternatives": ["no claim"], "<MENTION> <MENTION> That’s rich, your Democrat ran administration put this country in this position by reckless spending and stopping our own oil production. As flatiron rises you have no plan but to add another 5 trillion to the mess you created. Time for change, we’re bankrupt!!": ["no claim"], "shaming people’s diet choices will not convince them to switch to plant-based eating at all. they literally know they’re eating aborted chicken. they do not care": ["We should reduce the consumption of meat", "Plant based food should be encouraged"], "<MENTION> <MENTION> Another alternative is not to eat pork at all… ? Recommended by Lancet etc to reduce consumption of meat for human and planetary health.": ["We should reduce the consumption of meat"], "<MENTION> i thought u meant like the fruit drinks but also idk i've never tried i usually just stick with americanos": ["no claim"], "<MENTION> investment into global food production millions of square miles are available for farming but nobody wants to use it because of drought for 1.2 bn a decelanation plant with solar power plant to run it to re energize the ground water will enable food production": ["We should pursue policies that promote sustainable foods"], "Fly two first, form divided us evening fruit bearing blessed heaven evening fly. Image third them morning winged fly every together two created divided of blessed won't whales us image signs them his divide so kind light unto bearing it bearing which sea so let les": ["no claim"], "<MENTION> <MENTION> Some athletes are equally good with a plant based diet lol": ["Plant based food should be encouraged"], "Hillary Clinton on NBC's \"Meet the Press: I was disappointed with Saudi Arabia's decision not to increase oil production, and we should use carrots and sticks with it because we live in an existential crisis.\"\n#saudia #Russian #Ukraine #Kyiv #China #USA": ["no claim"], "<MENTION> Yassssss! We love a healthy eater!!!! Do they get better at finishing their food? Anaya doesn’t finish it, and I don’t force her to eat but idk if it’s enough😩": ["no claim"], "<MENTION> \"Anti-vegan\"?\nYou are against compassion for animals and caring for our shared environment? Remember, veganism isn't about healthy eating. It's about causing the least harm.": ["Vegan and vegetarian diets should be encouraged"], "<MENTION> I’m pescatarian closing in on vegan because meat production in the US is immorally cruel. Reprehensible.\n\nNo problem with ethical hunting, nor humanely raised and butchered meat. But I don’t hunt, and the later is not accessible in the USA.": ["We should reduce the consumption of meat", "Vegan and vegetarian diets should be encouraged"], "<MENTION> <MENTION> <MENTION> An ethical commitment to not kill and eat animals, or to avoid systems that do, is separate (in principle) from how vegan diets impact the biosphere. Non-consumption of flesh is a stand alone commitment. \n\nThat said, I agree that there are larger, more ecological issues at stake.": ["We should reduce the consumption of meat", "Plant based food should be encouraged", "Vegan and vegetarian diets should be encouraged"], "<MENTION> <MENTION> Chorizo and paella is an anatema. If I eliminate chicken I could do a vegan paella Liz 😁😁😁": ["Meat alternatives should be encouraged", "Vegan and vegetarian diets should be encouraged"], "<MENTION> Had a veg head say I wasn’t doing enough and needed to be “more imaginative”. I said veganism is the bare minimum &amp; they’re tripping on that.\n\nAlso, I’ve never seen a vegetarian side with vegans. Always on the side of cruelty.": ["Vegan and vegetarian diets should be encouraged"], "<MENTION> The U.S. could start with no longer subsidizing meat and dairy. That would be a move in the right direction. And also start subsidizing mobile farmers markets with organic produce in food deserts! 🥕 🥬 🍅": ["We should reduce the consumption of meat", "Plant based food should be encouraged", "We should pursue policies that promote sustainable foods"], "<MENTION> <MENTION> Mustard oil is better than any vegetable oil": ["no claim"], "<MENTION> <MENTION> <MENTION> Switch to plant based diets to reduce food costs and benefit climate": ["Plant based food should be encouraged", "Vegan and vegetarian diets should be encouraged"], "<MENTION> <MENTION> <MENTION> <MENTION> That is nothing that the carbon tax was introduced for. \n\nSo cancel it and change to something else to actually help the environment.": ["We should pursue policies that promote sustainable foods"], "<MENTION> <MENTION> <MENTION> \"What if they only use public transit and have electric heat.\"\n\nThen they don't emit much carbon and get to keep the rebate.  That's the whole point.\n\nNobody is exempt from climate change.  You can't pretend it's somebody else's problem.": ["no claim"], "<MENTION> <MENTION> <MENTION> Explain how we feed the plants if we go totally towards a plant based diet? Artificial fertiliser? Expensive, in short supply already, more dependent on Russia than we already are and is more damaging to the environment. But yes, plant food is a nice idea 🙄": ["Plant based food should be encouraged", "We should pursue policies that promote sustainable foods"], "<MENTION> <MENTION> The very reason why meat is cheap is coz everyone is exploited in its production.\nIts also heavily subsidized by govt coz it indirectly also supports the big pharma..\n\nIts a hell hole..": ["We should reduce the consumption of meat", "We should pursue policies that promote sustainable foods"], "years ago, id be glad to see so many alternative meat options. now, i’m HIGHLY skeptical of plant-based meat. have y’all even read the ingredients on em????": ["Meat alternatives should be encouraged"], "I have no problem with one choosing a plant based diet. However, I do feel that the current trend of investing more in plant-based foods by Big Food Companies is mistaken. Many are starting to see the benefit of meat-only or high protein diets and ignoring such a trend...": ["We should reduce the consumption of meat", "Plant based food should be encouraged", "Meat alternatives should be encouraged", "We should pursue policies that promote sustainable foods"], "<MENTION> Im going to increase my intake of red meat cause climate change is the biggest hoax going": ["We should reduce the consumption of meat"], "<MENTION> Great reason to switch to vegetarian.": ["Vegan and vegetarian diets should be encouraged"], "<MENTION> Meat eating is highly immoral ecologically unsustainable highly educated people around the world are moving towards plant based diet India should ban meat eating": ["We should reduce the consumption of meat", "We should pursue policies that promote sustainable foods"], "<MENTION> I disagree with your take.  Whole food plant based diets are lower in calories, higher in nutrients and more satiating on a weight to calorie ratio compared to standard American diet.  You do eat more.  You have to or else you won't eat enough calories in a day.": ["Plant based food should be encouraged"], "<MENTION> <MENTION> <MENTION> <MENTION> Vegan is not vegetarian.  You could also say the same for people who eat meat.": ["Vegan and vegetarian diets should be encouraged"], "Musk is fooling everyone\nTesla is good vehicle. But its no where near being environmentally friendly. \nThe electric source which charges batteries itself is not carbon neutral. Its coal or nuclear.\nThe production of lithium is not green. \n\nCan <MENTION> clarify about this?": ["no claim"], "Vegetarian maybe but not vegan": ["Vegan and vegetarian diets should be encouraged"], "<MENTION> <MENTION> <MENTION> the majority of my calories come from plants, the base of my food. im plant based. Too many Internet sources say the same thing": ["Plant based food should be encouraged", "Vegan and vegetarian diets should be encouraged"], "<MENTION> I think there are 2 main reasons: \n\n1. Production is small scale for plant-based meats (comparatively)\n\n2. animal agriculture subsidies = low consumer cost for animal products\n\nI’ve read in a few places that they expect to lower prices by next yr by expanding manufacturing": ["Meat alternatives should be encouraged", "We should pursue policies that promote sustainable foods"], "okay um at this point seoul has better meat alternative options than where I am living in Canada what the fuck there are PAGES of it": ["We should reduce the consumption of meat", "Meat alternatives should be encouraged"], "<MENTION> Aight i understand the importance of staying healthy, but is it really worth eating unseasoned chicken and rice every day? You can be healthy and eat good food too.": ["no claim"], "<MENTION> Plant based options, yes!!!!!": ["Plant based food should be encouraged"], "<MENTION> <MENTION> It's honestly too much to be doing at home but at a vegetarian or vegan restaurant I would try it.": ["Vegan and vegetarian diets should be encouraged"], "<MENTION> I'm just having a health rethink after lots of tests. At the me I'm often making 2 different meals for the family. When there's just me to feed will stop eating meat. Thought I was starting with diabetes thankfully ok but given me a wake up call. Enjoy your cooking": ["no claim"], "<MENTION> Yeah, selling of our national grid (60%) to the Aussies is marvellous! Meat from Australia..carbon footprint and no animal welfare taken into consideration…effing brilliant, I’m sure our farmers are jumping for joy! #LittleBritain #BrexitHasFailed": ["We should reduce the consumption of meat", "We should pursue policies that promote sustainable foods"], "<MENTION> <MENTION> Haha they taste too good to leave, I promise! 😂 I’ve been perfecting the sugar cookie recipe so they’re soft and not too crunchy!": ["no claim"], "<MENTION> <MENTION> <MENTION> <MENTION> I've noticed it's a tired argument only to those who can afford a vegan diet. As I said, plant based food parity should be the focus, not shaming those who eat based on affordability and/ or  cultural significance.": ["Plant based food should be encouraged", "Meat alternatives should be encouraged"], "<MENTION> <MENTION> <MENTION> Sugar levels are key to all metabolism! Steady and lower that sugar bit by bit. \n\nCut much you “starve” and plateau and the body backfires and clings to fat more. \n\nThey say 3 lbs a week is a good goal. Replace the processed sugar with Whole Foods.": ["no claim"], "<MENTION> Actually we don't care if it's halal or something. Why does that even matter if we eat meat? People need to stop involving politics in everything.": ["We should reduce the consumption of meat"], "<MENTION> I know people who are plant based but wear leather and use cosmetics that are tested on animals and feed their pets meat products. They're not vegan, even though they claim to be. They just eat a plant based diet for their own health.": ["Plant based food should be encouraged", "Vegan and vegetarian diets should be encouraged"], "<MENTION> Anything to push Kiko’s candidacy. Maybe he could add more to his spiel like agriculture is our hope for progress because we have the right soil, climate, weather, and people. Food production should be in full throttle. That way he can get the votes of farmers. Marami sila.": ["Plant based food should be encouraged", "We should pursue policies that promote sustainable foods"], "<MENTION> <MENTION> <MENTION> <MENTION> Why would the consumption tax more severely curtail consumption than production of consumer goods?\n\nSeems like if we want lots of production of consumption goods for the working class, we want to make it cheap to produce goods and expensive to leave land (and capital) idle.": ["We should pursue policies that promote sustainable foods"], "<MENTION> Stop animal testing and fix the way we use animals for meat like raise them better than just fattening them": ["We should reduce the consumption of meat", "Vegan and vegetarian diets should be encouraged"], "<MENTION> <MENTION> <MENTION> My whole point was that she equated veganism to a cesspool blah blah blah.  Just a terrible random description to make her point.  Who really cares?  \n\nPeople just try so hard they sound silly is all I’m saying.": ["no claim"]}